In [1]:
import pandas as pd

In [2]:
#CAN NO LONGER IMPORT POPULATION FILE DELETED
#population = pd.read_csv("Data/Population_data.csv", skiprows=4)

In [3]:
#population.head()

In [4]:
#Only keep columns Name, Code and 2021. Remove other columns
#population = population[["Country Name","Country Code", "2021"]]

In [5]:
#Write updated file to a new csv
#population.to_csv("Population.csv")

In [57]:
#Read in the population data
df = pd.read_csv('Data/Population.csv')

In [7]:
#Check population data
df

     Unnamed: 0  Country Name Country Code        2021
0             0         Aruba          ABW    106537.0
1             2   Afghanistan          AFG  40099462.0
2             4        Angola          AGO  34503774.0
3             5       Albania          ALB   2811666.0
4             6       Andorra          AND     79034.0
..          ...           ...          ...         ...
213         261        Kosovo          XKX   1786038.0
214         262   Yemen, Rep.          YEM  32981641.0
215         263  South Africa          ZAF  59392255.0
216         264        Zambia          ZMB  19473125.0
217         265      Zimbabwe          ZWE  15993524.0

[218 rows x 4 columns]

In [8]:
df.drop(["Unnamed: 0"], axis=1, inplace=True)
#Drop additional unnecesasry column

In [9]:
df.sort_values(by=["2021"])

                 Country Name Country Code          2021
199                    Tuvalu          TUV  1.120400e+04
149                     Nauru          NRU  1.251100e+04
156                     Palau          PLW  1.802400e+04
208    British Virgin Islands          VGB  3.112200e+04
121  St. Martin (French part)          MAF  3.194800e+04
..                        ...          ...           ...
152                  Pakistan          PAK  2.314021e+08
89                  Indonesia          IDN  2.737532e+08
204             United States          USA  3.318937e+08
91                      India          IND  1.407564e+09
37                      China          CHN  1.412360e+09

[218 rows x 3 columns]

Drop rows which are not countries ie World, IDA & BRD total etc.

In [10]:
#df.drop([156, 140, 103, 259], inplace=True)

In [11]:
#df.drop([249, 139, 110, 62, 102], inplace=True)

In [12]:
#df.drop([249, 139, 110, 62, 102], inplace=True)

In [13]:
#df.sort_values(by=["2021"])

Manually cleaned the data by going thorugh row by row and checking if it was a country or not

In [14]:
dfSO = pd.read_csv("Data/survey_result_clean_renamed.csv")

In [15]:
dfSO.head()

,Unnamed: 0,ResponseId,MainBranch,Employment,RemoteWork,CodingActivities,EdLevel,LearnCode,LearnCodeOnline,LearnCodeCoursesCert,...,InteractOutsideOfImmediateTeam,KnowledgeSilo,TimeSearching,TimeAnswering,Onboarding,ProfessionalTech,SupportNewHiresOnboarding,LearnResourcesProvidedByEmp,GiveTimeToLearnNewSkill,ConvertedCompYearly
0,0,1,None of these,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1,2,I am a developer by profession,"Employed, full-time",Fully remote,Hobby;Contribute to open-source projects,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,2,3,"I am not primarily a developer, but I write co...","Employed, full-time","Hybrid (some remote, some in-person)",Hobby,"Master’s degree (M.A., M.S., M.Eng., MBA, etc.)",Books / Physical media;Friend or family member...,Technical documentation;Blogs;Programming Game...,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,40205.0
3,3,4,I am a developer by profession,"Employed, full-time",Fully remote,I don’t code outside of work,"Bachelor’s degree (B.A., B.S., B.Eng., etc.)","Books / Physical media;School (i.e., Universit...",NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,215232.0
4,4,5,I am a developer by profession,"Employed, full-time","Hybrid (some remote, some in-person)",Hobby,"Bachelor’s degree (B.A., B.S., B.Eng., etc.)","Other online resources (e.g., videos, blogs, f...",Technical documentation;Blogs;Stack Overflow;O...,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [16]:
dfSO.columns

Index(['Unnamed: 0', 'ResponseId', 'MainBranch', 'Employment', 'RemoteWork',
       'CodingActivities', 'EdLevel', 'LearnCode', 'LearnCodeOnline',
       'LearnCodeCoursesCert', 'YearsCode', 'YearsCodePro', 'DevType',
       'OrgSize', 'PurchaseInfluence', 'BuyNewTool', 'Country', 'Currency',
       'CompTotal', 'CompFreq', 'LanguageHaveWorkedWith',
       'LanguageWantToWorkWith', 'DatabaseHaveWorkedWith',
       'DatabaseWantToWorkWith', 'PlatformHaveWorkedWith',
       'PlatformWantToWorkWith', 'WebframeHaveWorkedWith',
       'WebframeWantToWorkWith', 'MiscTechHaveWorkedWith',
       'MiscTechWantToWorkWith', 'ToolsTechHaveWorkedWith',
       'ToolsTechWantToWorkWith', 'NEWCollabToolsHaveWorkedWith',
       'NEWCollabToolsWantToWorkWith', 'OpSysProfessional use',
       'OpSysPersonal use', 'VersionControlSystem', 'VCInteraction',
       'OfficeStackAsyncHaveWorkedWith', 'OfficeStackAsyncWantToWorkWith',
       'OfficeStackSyncHaveWorkedWith', 'OfficeStackSyncWantToWorkWith',
       'Blockchain', 'NEWSOSites', 'SOVisitFreq', 'SOAccount', 'SOPartFreq',
       'SOComm', 'Age', 'Gender', 'Sexuality', 'Ethnicity', 'Accessibility',
       'TBranch', 'ICorPM', 'WorkExp', 'InteractOutsideTeam',
       'KnowledgeSiloPrevent', 'UpToDateOrgInfo', 'FindAnsW/Tools',
       'KnowHowToFindAns', 'AnsQWhichAlreadyAnsBefore', 'WaitForAnsRuinW/Flow',
       'NeedHelpOutsideOfImmediateTeam', 'InteractOutsideOfImmediateTeam',
       'KnowledgeSilo', 'TimeSearching', 'TimeAnswering', 'Onboarding',
       'ProfessionalTech', 'SupportNewHiresOnboarding',
       'LearnResourcesProvidedByEmp', 'GiveTimeToLearnNewSkill',
       'ConvertedCompYearly'],
      dtype='object')

In [17]:
Nation_SO_Ans_Rate = dfSO["Country"].value_counts()

In [18]:
Nation_SO_Ans_Rate

United States of America                                13543
India                                                    6639
Germany                                                  5395
United Kingdom of Great Britain and Northern Ireland     4190
Canada                                                   2490
                                                        ...
Monaco                                                      1
Djibouti                                                    1
Seychelles                                                  1
Solomon Islands                                             1
Saint Kitts and Nevis                                       1
Name: Country, Length: 180, dtype: int64

In [19]:
#Remove nations which have fewer than 500 responses to the survey
Nation_SO_Ans_Rate = Nation_SO_Ans_Rate.drop(index=[row for row, value in Nation_SO_Ans_Rate.iteritems() if value < 500])

C:\Users\alexp\AppData\Local\Temp\ipykernel_2288\1583955902.py:2: FutureWarning: iteritems is deprecated and will be removed in a future version. Use .items instead.
  Nation_SO_Ans_Rate = Nation_SO_Ans_Rate.drop(index=[row for row, value in Nation_SO_Ans_Rate.iteritems() if value < 500])

In [20]:
#Nation_SO_Ans_Rate.to_csv("Answered_per_nation.csv")

In [46]:
Nation_SO_Ans_Rate = pd.read_csv("Visualise_Data/Answered_per_nation.csv")

In [47]:
Nation_SO_Ans_Rate.head()

     Country Name  Num_of_people
0   United States          13543
1           India           6639
2         Germany           5395
3  United Kingdom           4190
4          Canada           2490

In [48]:
df.head()

  Country Name Country Code        2021
0        Aruba          ABW    106537.0
1  Afghanistan          AFG  40099462.0
2       Angola          AGO  34503774.0
3      Albania          ALB   2811666.0
4      Andorra          AND     79034.0

In [49]:
type(Nation_SO_Ans_Rate)

pandas.core.frame.DataFrame

In [50]:
type(df)

pandas.core.frame.DataFrame

In [51]:
df.head()

  Country Name Country Code        2021
0        Aruba          ABW    106537.0
1  Afghanistan          AFG  40099462.0
2       Angola          AGO  34503774.0
3      Albania          ALB   2811666.0
4      Andorra          AND     79034.0

In [56]:
Nation_SO_Ans_Rate.shape

(33, 2)

In [52]:
Nation_SO_Ans_Rate.head()

     Country Name  Num_of_people
0   United States          13543
1           India           6639
2         Germany           5395
3  United Kingdom           4190
4          Canada           2490

In [58]:
merge = pd.merge(Nation_SO_Ans_Rate, df, on='Country Name')

In [59]:
merge.head()

     Country Name  Num_of_people  Unnamed: 0 Country Code          2021
0   United States          13543         251          USA  3.318937e+08
1           India           6639         109          IND  1.407564e+09
2         Germany           5395          55          DEU  8.319608e+07
3  United Kingdom           4190          81          GBR  6.732657e+07
4          Canada           2490          35          CAN  3.824611e+07

In [60]:
merge.shape

(32, 5)

In [63]:
merge.drop(columns=['Country Code','Unnamed: 0'], inplace=True)

In [64]:
merge.head()

     Country Name  Num_of_people          2021
0   United States          13543  3.318937e+08
1           India           6639  1.407564e+09
2         Germany           5395  8.319608e+07
3  United Kingdom           4190  6.732657e+07
4          Canada           2490  3.824611e+07

Calculating the fraction of the population who responded

In [70]:
fraction = []
for index, row in merge.iterrows():
    population = row["2021"]
    respondents = row["Num_of_people"]
    fractions_respondents = respondents / population
    fraction.append(fractions_respondents)
    
merge["Fraction_respondents"] = fraction

In [82]:
merge.head().sort_values(by="Fraction_respondents", ascending=False)

,Country Name,Num_of_people,2021,Fraction_respondents,Normalised value
4,Canada,2490,3.824611e+07,0.000065,1.595498
2,Germany,5395,8.319608e+07,0.000065,1.589179
3,United Kingdom,4190,6.732657e+07,0.000062,1.525147
0,United States,13543,3.318937e+08,0.000041,1.000000
1,India,6639,1.407564e+09,0.000005,0.115590

In [83]:
merge.head()

,Country Name,Num_of_people,2021,Fraction_respondents,Normalised value
0,United States,13543,3.318937e+08,0.000041,1.000000
1,India,6639,1.407564e+09,0.000005,0.115590
2,Germany,5395,8.319608e+07,0.000065,1.589179
3,United Kingdom,4190,6.732657e+07,0.000062,1.525147
4,Canada,2490,3.824611e+07,0.000065,1.595498

In [128]:
Xmin = merge["Fraction_respondents"].min()

In [129]:
Xrange = (merge["Fraction_respondents"].max()) - Xmin

In [130]:
merge["Fraction_respondents"].sort_values(ascending=False)

14    1.070845e-04
13    9.792804e-05
28    9.339678e-05
15    9.301238e-05
8     8.868968e-05
16    8.489962e-05
19    6.586855e-05
4     6.510466e-05
2     6.484681e-05
3     6.223397e-05
11    5.691356e-05
26    5.452707e-05
21    5.399833e-05
27    5.149785e-05
7     4.588429e-05
0     4.080523e-05
5     3.436181e-05
9     3.207795e-05
24    3.038722e-05
10    2.561341e-05
23    1.354102e-05
30    1.137337e-05
6     9.840140e-06
12    8.567488e-06
17    8.223064e-06
1     4.716660e-06
25    4.530203e-06
22    3.619589e-06
18    3.072573e-06
31    2.422665e-06
29    1.961621e-06
20    4.474780e-07
Name: Fraction_respondents, dtype: float64

In [131]:
Xmin, Xrange

(4.474779801183834e-07, 0.00010663704813351185)

In [141]:
to_Normalise = []

for index, row in merge.iterrows():
    frac_pop = row["Fraction_respondents"]
    normalised_row = (frac_pop - Xmin) / Xrange
    to_Normalise.append(normalised_row)

merge["Normalised value"] = to_Normalise

In [142]:
merge.head()

,Country Name,Num_of_people,2021,Fraction_respondents,Normalised value
0,United States,13543,3.318937e+08,0.000041,0.378459
1,India,6639,1.407564e+09,0.000005,0.040035
2,Germany,5395,8.319608e+07,0.000065,0.603911
3,United Kingdom,4190,6.732657e+07,0.000062,0.579409
4,Canada,2490,3.824611e+07,0.000065,0.606329

In [143]:
merge.head().sort_values(by="Normalised value", ascending=False)

,Country Name,Num_of_people,2021,Fraction_respondents,Normalised value
4,Canada,2490,3.824611e+07,0.000065,0.606329
2,Germany,5395,8.319608e+07,0.000065,0.603911
3,United Kingdom,4190,6.732657e+07,0.000062,0.579409
0,United States,13543,3.318937e+08,0.000041,0.378459
1,India,6639,1.407564e+09,0.000005,0.040035